{"data":{"site":{"siteMetadata":{"title":"Chris Frewin's Full Stack, Web Development, ABAP, SAPUI5, Blockchain, Machine Learning, & Natural Language Processing Blog.","author":"Chris Frewin"}},"markdownRemark":{"id":"c1c7ac29-b184-5fc6-a1b7-4f1a659ad325","excerpt":"Add some spice to your SAPUI5 apps! (Or even normal webapps, for that matter) I was a noob. I wrote in my SAPUI5 some warehouse task code…","html":"<h1>Add some spice to your SAPUI5 apps!</h1>\n<h2>(Or even normal webapps, for that matter)</h2>\n<p>I was a noob. I wrote in my SAPUI5 some warehouse task code that would have a real time. How did I do it?</p>\n<p>I wrote a <code class=\"language-text\">window.setInterval()</code> function that would ping table <code class=\"language-text\">/SCWM/WT</code> 😊 and check for any new lines - with an OData <code class=\"language-text\">GET_ENTITY_SET</code> server request. 😊 😊</p>\n<p>Yeah.</p>\n<p>Well, I was lucky to learn about websockets from one of our EWM. Then I was even luckier to learn a bit more about the technical aspects (when to subscribe, unsubscribe, destroy, and create websockets instances from actions on the front end).</p>\n<p>So here’s how to add websockets to your SAPUI5 app<sup><a href=\"#footnote-1\">1</a></sup>.</p>\n<h2>Transactions</h2>\n<p>All backend push and messaging channels can be managed with just two transactions:  <code class=\"language-text\">SAMC</code>, for message channels and <code class=\"language-text\">SAPC</code>, for push channels. Easy enough.</p>\n<h2>Creating a Message Channel</h2>\n<p>As we will see, to create a proper push channel, we will first need a message channel, so that is where we start off. An ABAP message channel is a way of subscribing current programs to any - the best thing about push channels is that if the push channel <em>isn’t</em> listening, there is no error and nothing else negative happens anywhere else in the system - that is, granted you <code class=\"language-text\">TRY</code> and <code class=\"language-text\">CATCH</code> your push channel messaging properly.</p>\n<p>So let’s get started in transaction <code class=\"language-text\">SAMC</code>:</p>\n<p><img src=\"\"></p>\n<p>We define the message channel name, and, most importantly, define what programs can use this message channel and what type of message this channel will handle (there are only 2 - numeric and string)</p>\n<p>Now, as I mention before, we use these channels to hook into any ABAP program, so that any time they are executed by anyone (or anything) in the system, the channel will be messages. A safe way to hook into an existing program (using our newly created <code class=\"language-text\">Z_AWESOME_CHANNEL</code>) looks as follows:</p>\n<div class=\"gatsby-highlight\">\n      <pre class=\"language-abap\"><code class=\"language-abap\"><span class=\"token keyword\">REPORT</span> my_super_cool_existing_report</code></pre>\n      </div>\n<h2>Creating a Push Channel</h2>\n<p>Ok, now we head to transaction <code class=\"language-text\">SAPC</code> - we are no going to define a websocket that will be hooked up to our push channel. That way, when something happens in our program, it will message to all subscribed channels, which will be forwarded , and then ultimately, to the most important part, the frontend for our user to see!</p>\n<h2>Frontend</h2>\n<p>On the frontend I create a general websocket function that creates a websocket instance. In order to have the correct service for each view, upon each view change I call this function, which always creates a new instance if there exists a websocket instance already. This way we are sure that on any view change, we have a fresh running instance of the websocket doing the correct task for this view.</p>\n<p>That function looks like this:</p>\n<div class=\"gatsby-highlight\">\n      <pre class=\"language-text\"><code class=\"language-text\"></code></pre>\n      </div>\n<p>Note that you of course have to us <code class=\"language-text\">ws://</code> as the protocol in the link name!</p>\n<p>On the backend, that ends up looking like a <code class=\"language-text\">CASE</code> statement:</p>\n<div class=\"gatsby-highlight\">\n      <pre class=\"language-abap\"><code class=\"language-abap\"><span class=\"token keyword\">CASE</span></code></pre>\n      </div>\n<h2>Code</h2>\n<p>Yep, you’re going to have to write some ABAP code too. Luckily for us, when we create a push channel in transaction SAPC, SAP generates a class skeleton with 4 methods:</p>\n<p><code class=\"language-text\"></code>\n<code class=\"language-text\"></code>\n<code class=\"language-text\"></code></p>\n<hr/>\n<h1>Footnotes</h1>\n<div id=\"footnote-1\">\n1. Note that unfortunately the SAP Web IDE does not yet support websockets, that is, without network wizardry. I haven't managed to get it to work. I've left  long ago a message with the person who was the lead on Cloud Connector asking if websocket (`ws` protocol) would eventually something to be supported, but haven't heard anything.\n</div>","frontmatter":{"title":"ABAP Push and Message Channels","date":"January 12, 2018","draft":true}}},"pageContext":{"slug":"/abap-push-and-message-channels/","prev":null,"next":{"fields":{"slug":"/a-detailed-tutorial-shopify-storefront-apireact-redux/"},"frontmatter":{"date":"07 November, 2018","title":"A Detailed Tutorial - Shopify's Storefront API + React + Redux","draft":false,"link":"https://chrisfrew.in/a-detailed-tutorial-shopify-storefront-apireact-redux/","relativeLink":"/a-detailed-tutorial-shopify-storefront-apireact-redux/"}}}}