{"data":{"site":{"siteMetadata":{"title":"Chris Frewin's Full Stack Blog.","author":"Chris Frewin"}},"markdownRemark":{"id":"6a231307-a6d5-5b74-a322-cc9dce97b4c1","excerpt":"The motivation to write this post has come to me over the past few weeks as there has been another  wave of scary environmental press from…","html":"<p>The motivation to write this post has come to me over the past few weeks as there has been another <a href=\"https://www.theguardian.com/environment/2018/dec/03/david-attenborough-collapse-civilisation-on-horizon-un-climate-summit\">wave of scary environmental press from the UN</a>, and of course the <a href=\"https://unfccc.int/katowice\">next set of climate talks in Katowice, Poland that are currently taking place</a></p>\n<p>I often see that individuals have general feelings of despair and nihilism about climate change: that the problem is too big, that one person can’t make a difference, and so on. That is a problem in and of itself! If the default feeling is one of hopelessness, well guess what? The culture around environmental protection, climate change, and the like, will be one of hopelessness!</p>\n<p>But, I have a fix for that! </p>\n<p><img src=\"/thumbs-023fb0932bd433ca33ca0fe88a78d797.gif\" alt=\"A fix.\">\n<br/>\n<sub class=\"subtitle\">Yes!</sub></p>\n<p>I’ve generated a simple list of actions you can take -all of which I already am doing myself, so that I can’t be called hypocritical :) </p>\n<p>I’ll admit, this is a bit of moral showboating on my part, but at the same time, these are things that, once you make the switch, you don’t really need to think about them anymore. It’s a one-time action, so get out there and make the switch! </p>\n<p>So, here’s my simple list. I invite you to ‘make the switch’ to all of them, and to think of any of your own!</p>\n<ul>\n<li>Paying 5-10% extra per month for renewable energy from the grid (I believe most energy providers have this option these days - and yes, we know the electrons in the grid come from a variety of sources, the majority of them, unfortunately, still fossil fuel sources, but the electricity company uses the money that you pay extra to in turn pay those renewable energy providers, such as wind and solar, ultimately encouraging them to grow and creating a positive adoption feedback cycle)</li>\n<li>Eating meat a maximum of once per week max (if you’re doing even less, great!)</li>\n<li>Not owning a car (feet, bikes, and buses rule!) Also, I have to admit I’ve been overly skeptical of the public transportation system in the US, spoiled by the system here in Europe - but I’ve found between local city / state bus routes, Greyhound, and Amtrak, our situation in the US is not so bad - it’s just that our country is so damn big that public transportation seems relatively ridiculous :)</li>\n<li>Buying groceries grown / produced locally (this one is already well underway around the world and most of the time quite easy to follow, and I’m pleased to see it develop)</li>\n<li>(I almost forgot this last one!) No air conditioning - suck it up, it’s not that hot. What do you think, hmmm let’s see… <em>all of humanity did</em> before <a href=\"https://www.google.com/search?q=what+year+was+air+condition+invented&#x26;oq=what+year+was+air+condition+invented&#x26;aqs=chrome..69i57j69i64.6281j0j7&#x26;sourceid=chrome&#x26;ie=UTF-8\">1902</a>? (Let me be clear: they didn’t die because they didn’t have air conditioning… obviously 😉)</li>\n</ul>\n<p>You’ll also find that these points, while providing environmental benefit, are the exact same points that early-retirement hero <a href=\"http://www.mrmoneymustache.com/2016/03/15/mother-earth/\">Mr. Money Moustache (MMM) also touts as excellent money savers</a>! (If you don’t know who MMM is, here’s a one sentence overview: MMM is a super thrifty guy who was in the workforce for 10 years and 10 years alone, saving a huge majority of his income, and retired with his wife at age 30. For personal finance, his blog is a great one. Okay that, including this, makes three sentences 😂)</p>\n<p>Actually, the benefits from these points would ultimately flourish in a multi-fold fashion, if <em>everyone</em> adopted them. Just as I write this post, with no extra critical thinking, I can immediately think of a few benefits that would emerge:</p>\n<ul>\n<li>cleaner air where population density is high (no personal cars, hopefully just environmentally friendly or alternative fuel / electric public transportation)</li>\n<li>higher respect for meat as a luxury item, and thus higher respect and treatment of livestock (and likely higher quality, and more income for farmers!).</li>\n</ul>\n<p>Granted, I admit that I have probably a slight advantage in that the nature of my work as a software engineer I can work from home (or really anywhere), which of course gives rise to my non-existent need of a car.</p>\n<p>I’ll also concede that ‘just following a list of things’ is a bit naïve to solve the beast that is climate change, but it’s a start.</p>\n<p>The crucial point comes back to what I said at the beginning of this post: if you are hopeless by default, you probably won’t even take these points to heart, thinking any effort is useless. </p>\n<p>These are things that <em>everyone</em> needs to do to be effective. </p>\n<p><strong>But ‘everyone’ always starts with just one person.</strong></p>\n<p>Cheers! 🍺</p>\n<p>Chris</p>","frontmatter":{"title":"Simple Actions You Can Take Right Now to Improve the Environment and Combat Climate Change","date":"December 07, 2018","draft":false,"starID":100,"postType":"life"}}},"pageContext":{"slug":"/simple-things-you-can-do-right-now-to-help-environmental-efforts/","prev":{"fields":{"slug":"/sending-windows-commands-from-sap-abap/"},"frontmatter":{"date":"13 December, 2017","title":"Sending Windows Server Commands From SAP ABAP","draft":false,"starID":3,"postType":"dev","link":"https://chrisfrew.in/sending-windows-commands-from-sap-abap/","relativeLink":"/sending-windows-commands-from-sap-abap/"}},"next":{"fields":{"slug":"/the-dreaded-referenceerror-window-is-not-defined/"},"frontmatter":{"date":"08 December, 2018","title":"Oh The Horror! The Dreaded \"WebpackError ReferenceError window is not defined\"!","draft":false,"starID":101,"postType":"dev","link":"https://chrisfrew.in/the-dreaded-referenceerror-window-is-not-defined/","relativeLink":"/the-dreaded-referenceerror-window-is-not-defined/"}}}}