{"data":{"site":{"siteMetadata":{"title":"Chris Frewin's Full Stack, Web Development, ABAP, SAPUI5, Blockchain, Machine Learning, & Natural Language Processing Blog.","author":"Chris Frewin"}},"markdownRemark":{"id":"/Users/chris/projects/chrisfrew.in/src/pages/one-major-challenge-with-the-internet-and-society/index.md absPath of file >>> MarkdownRemark","excerpt":"* In an amazingly ironic turn of events, I got my first donation from an ABAP post on this blog  * while *  I was drafting this post…","html":"<p><sup><i>*In an amazingly ironic turn of events, I got my first donation from an ABAP post on this blog *while* I was drafting this post! However, while it gives me more hope personally, I think this post is still extremely relevant (one blog donation is of course not going to )</i><sup></p>\n<h1>Ads, Companies, Creators, Makers, the Network Effect, and Redistribution</h1>\n<p>And no, before you think where this post is going, this post isn’t going to be a crypto rant about how fiat is bad or governments printing money control our lives and blah blah blah.</p>\n<p>No, this post is going to be about the culture around payments, donations, and transactions in general online - and what could be a revolution and explosion in creativity.</p>\n<p>I’ve been mulling over this thread of thought for months now. After enough rumination, I’ve finally been able to pull it all together into this fairly large post. I’ve collected a variety of fairly recent sources that show these issue shows some strong trends and is coming to a point and predictions for the future.</p>\n<p>I start off with what is going on with creators or creative entities - whether companies or individual Makers (all credit to <a href=\"https://producthunt.com\">Product Hunt</a> for that term 😉), and then shifting to how everything appears to us, modern day consumers. I finish with a prescribed solution to the problem, and things that I am continuing to consider, even after distilling my thoughts into this post.</p>\n<p>This is a longer, non-dev post of mine, but I think these are very important issues that need to be discussed more often. So grab a ☕ and put your thinking cap on!</p>\n<h2>Advertisements and the Network Effect Perspective of Companies, Creators and Makers</h2>\n<h3>The Network Effect</h3>\n<p>A very important paper that was one of the first items that got me thinking along the lines of these issues is this paper about the role of luck. While it is aimed at individuals, if a company or organization is considered as an individual in the market, many of the same findings and principles can apply.</p>\n<p>So the paper found that . Unfortunately, most intelligent (or even most hard working!) were not those</p>\n<p>Since the researches had of course total control over the experiment, and as the second half. <em>This redistribution is exactly the issue I am going to get at in this post</em></p>\n<p>But wait you say, the internet is by definition a giant sharing and redistribution network. Indeed, but let’s be honest, it’s the sharing and redistribution of <em>information</em>, not money. </p>\n<h3>The subscription based web</h3>\n<p>To understand why redistribution hasn’t been monetary based and only information based, we have to look at the companies that define the internet right now. </p>\n<p>Let’s look at a concrete example by way of monthly subscription style services I’ve been thinking of subscribing to, but haven’t because I’m too much of a cheapo:</p>\n<ul>\n<li>$4 / mo. New Yorker Subscription (“just” $1 a week as their add states!!! 😑 )</li>\n<li>$5 / mo. Medium membership (yeah, the free version is not enough for me - I read a lot of people’s stuff)</li>\n<li>$6.67 / mo. The Economist (subscription itself is 12 weeks = 3 months, for $20)</li>\n<li>$5.99 / mo. Reddit Premium</li>\n</ul>\n<p>So… that adds up to nearly $16 a month, or $192 a year!</p>\n<p>and this is a conservative list - these are just the subscriptions that I’m toying with / have to deal with.</p>\n<p>As I I’m currently debating if I myself should subscribe to these services (see? I too am a self prophesizing problem of this issue!)</p>\n<p>I don’t argue that $1 a month or even $5 a month is too much for a single service. I guess what I’m trying to argue is that these profits go to big companies that benefit from subscribers and can benefit from their geometric self-fed network affect. Then these companies grow, and in order to grow their revenue they have to resort to one thing to keep growth metrics alive:</p>\n<p><strong>They use ads!</strong></p>\n<h3>The Ad-Death of the Modern Social Network Company</h3>\n<p><sup>See: <a href=\"https://en.wikipedia.org/wiki/Heat_death_of_the_universe\">The heat death of the universe</a></sup></p>\n<p>A joke I tell is picturing the end result of Facebook, Instagram, Twitter, and the like, will be only a constant stream of - not of what is going on with your family and friends’ life - but of ads!</p>\n<p>But then what? We’ve seen what happens as soon as Wall Street even gets wind of a decrease in earnings in the future. </p>\n<h3>Hope for Non-commercial Social Networks</h3>\n<p>What encourages me is what I’ve seen through <a href=\"https://hacktoberfest.digitalocean.com\">Hacktoberfest</a>, in that groups of passionate developers (dev.to is a great example)</p>\n<p>In these types of Social Web 3.0, the ads to me are a means to end: they keep the service up. In this case, the model is that members of the network come first, whereas (nowadays on Twitter and Facebook), it seems like the opposite is true: powerful tools and, while the ‘member’ of the network was bombarded with ads that, while it may indeed be targeted to the user’s interests, is none-the-less approaching spam levels.</p>\n<p>Another hope is the new generation Y is more charity product aware than any generation before. They are looking now, not even for companies and individuals that donate, but actively participate. I suppose from a Maker perspective, these are people who are actively contributing to online communities, podcasts, and blog posts, sharing their </p>\n<h2>The Consumer’s Perspective</h2>\n<p>From the consumer’s perspective, the current outlook of the economy supporting the internet is just as grim. Facebook is a prime example. I haven’t used Facebook for three years now, but I’ve looked over the shoulder of my buddy, and immediately noticed something, astounded: “what? its just all ads!” </p>\n<p>My buddy, sounding already very used to this deluge, replied “yep, facebook is just all ads now dude”. </p>\n<p>My brother, graduating with his bachelor’s degree this year (so just inside the start generation Y), says that he and his friends use facebook only mostly for events now, also because of this over-ad reason.</p>\n<p>Another Maker, Justin Jackson brings up another brilliant point is that with all these ads, the user is overwhelmed, and in Justin’s words ‘exhausted’ from the constant bombardment of the next big thing.</p>\n<p>Its true: while the consumer these days is empowered with making, this requires that producst be very useful, very unique, and with stories behind them. Printing some text on a t-shirt isn’t going to cut it in this next generation of the economy.</p>\n<h1>The Solution(s)</h1>\n<p>HOWEVER</p>\n<p>What if we thought of the cash flow like this: What if (I’ve checked multiple blogs that posted, for example, a Bitcoin or Ethereum address - they all have 0 transactions)</p>\n<p>Such a model could be applied to anything.</p>\n<p>There were groups trying to build such microtransaction systems (yes, even before crypto currency):</p>\n<h2>The dawn of the redistribution company</h2>\n<p>There’s another neat way to solve this. Let’s make an example: </p>\n<p>Chris sells widgets. Each widget Chris sells would normally provide him with $10 in profit. But what if Chris redistributes the profits from every widget sold to anyone who has every bought the widget - including Chris himself! Of course the profits I realize will become marginally smaller the more people that buy my ‘widget’… so, is this the very definition of a pyramid scheme? I don’t think so, because I’m distrubiting everything equally. The only problem is still the issue of early adopters - they will benefit financially the most, while some of the people to purchase the product last.  To some this may sound eerily ‘communist’. But whats the alternative? A mere handful of companies reaping (Okay, to be fair, according to Bruce Upbin at Forbes and three systems theorists from the Swiss Federal Institute of Technology, <a href=\"https://www.forbes.com/sites/bruceupbin/2011/10/22/the-147-companies-that-control-everything/#1f58903f5105\">40% of the wealth is controlled by 147 companies, and 80% if controlled by 737</a>. Meanwhile, 10 companies control 80% of the media.</p>\n<p>Anyway, lets do the math on such a scenario. I think its a bit weird to immediately get the refund back from your purchase, so lets consider the redistribution at the end of </p>\n<p>Still, this has the same structure as a corporate structure, also showing similiar effects like the cryptocurrency phase, in that early . Still, I think this method is in the right direction of creative and Maker wealth redistribution in my dream of our ‘new economy’.</p>\n<p>You’re probably thinking at this point, “this guy is crazy; I’m not going to read his blog anymore”. Good ma’am or sir, I laugh at you! No, to me, the prospect of having a huge economy where experts of all shapes and sizes can thrive based off donations and commission work. </p>\n<p>dAnd, as I’ve stated frequently, being a software developer who is interested and always willing to learn in 2018, I will never be short of having a ‘job that pays the bills’, although the vision in this post is to create an economy where that wont be needed anyway. 😉</p>\n<h2>My Pledge</h2>\n<p>Posting this giant post with all talk and no action would be pretty lame. Therefore. 90% of all donations to this site, will be recycled into the maker and creative economy of s this includes:</p>\n<ul>\n<li>Sam Harris’s Waking Up Podcast</li>\n<li>Dan Carlin’s Hardcore History (Which he made free and by volunteer donation only - excellent!)</li>\n<li>The GatsbyJS Team - fantastic work they are doing - also and example of the full tool which is totally free and donations are optional</li>\n<li>The <code class=\"language-text\">create-react-app</code> Team - another invaluable tool for developers like me who use React JS.</li>\n</ul>\n<p>I’m building out a page to track these recycled cash flows. I’m paying it forward in hopes to speed up my dream of a maker economy reality.</p>\n<h2>Future Considerations and More Work</h2>\n<p>But this project seems to have died out. This is an issue that I repeatedly think about, and will likely blog again.</p>\n<p>As I build out my arsenal of projects as a Maker (all credit to (<a href=\"https://producthunt.com\">https://producthunt.com</a>)[Product Hunt] for that term), I think I will be opting for the one time charge - or in the worst case, a yearly subscription. </p>\n<p>A common complaint by software engineers is that they don’t work on projects that are challenging and ground breaking, or for companies that by nature aren’t pushing the cutting edge. This issue was discussed in depth in a Hacker News thread.</p>\n<p>That the very nature of the network effect is a root cause of this issue. </p>\n<p>If we want smart people to have the freedom and security to work freely on large scale ‘moonshot’ projects (regardless of discipline - this applies to the arts, sciences, engineering, software - you name it) we <em>have</em> to be more open to supporting creators. I picture a world of networked freelancers all striving, while also volunteering time to contribute to open source versions of the things that we use Perhaps I’m missing something that isn’t feasible, but to me, its the solution of all the problems raised in this post.</p>\n<h2>Further Reading</h2>\n<p>Here are some other high quality pieces I think are worth reading, but couldn’t find a way to incorporate them smoothly into this post:</p>\n<p><a href=\"https://waitbutwhy.com/2018/04/picking-career.html\">Wait but Why - How to Pick a Career (That Actually Fits You)</a></p>\n<p>Cheers! 🍺</p>\n<p>Chris</p>","frontmatter":{"title":"One Major Challenge with the Internet & Society Today","date":"October 19, 2018","draft":true}}},"pageContext":{"slug":"/one-major-challenge-with-the-internet-and-society/","prev":{"fields":{"slug":"/how-to-be-an-american-living-in-austria-and-working-in-liechtenstein/"},"frontmatter":{"date":"17 January, 2018","title":"How to be an American living in Austria and working in Liechtenstein","draft":false,"link":"https://chrisfrew.in/how-to-be-an-american-living-in-austria-and-working-in-liechtenstein/","relativeLink":"/how-to-be-an-american-living-in-austria-and-working-in-liechtenstein/"}},"next":{"fields":{"slug":"/some-tasty-bash-profile-commands/"},"frontmatter":{"date":"09 April, 2018","title":"Some Tasty Bash Profile / Bashrc Commands To Make Your Life Better","draft":false,"link":"https://chrisfrew.in/some-tasty-bash-profile-commands/","relativeLink":"/some-tasty-bash-profile-commands/"}}}}