{"data":{"site":{"siteMetadata":{"title":"Chris Frewin's Full Stack Blog.","author":"Chris Frewin"}},"markdownRemark":{"id":"a998cae0-9102-55fe-b602-643489d11baf","excerpt":"Whew. It’s been over a month since my last post! This is mainly because of some of the projects I’ve been working on; so rest assured there…","html":"<p>Whew. It’s been over a month since my last post! This is mainly because of some of the projects I’ve been working on; so rest assured there will be plenty of new content coming soon. (I’ve been improving my development arsenal with Redux (haven’t had a need for it yet) and Redux Saga which leverages a lot of great JavaScript such as generator functions for async deliciousness, as well as joining a hackathon team to build a beerpong robot - but more of that in later posts.)</p>\n<h1>Robinhood - Options! AHAHAHAH! Oh wait… my money is gone 😭😭😭</h1>\n<p>Like many millennials will experience in the coming months, my options trading got unlocked on Robinhood. Robinhood is a commission free broker that initial started as a mobile-only (as far as I know Robinhood is only available for United States Citizens - sorry for everyone else - but options are definitely in the cards if you find the right broker!) Anyway, as I experiment with everything, why not also with options? What I’ve seen places for example like <a href=\"https://www.reddit.com/r/wallstreetbets/\">https://www.reddit.com/r/wallstreetbets/</a>, options trading can be extremely lucrative, but highly risky. I wanted to learn what they were all about and if it would be indeed possible for me to make some sustainable income - not in a risky YOLO method, but a calculated method that follows mathematical principles.</p>\n<h1>The Posts - on Medium</h1>\n<p>To spare you from more of my rambling, here’s the very first post of the series:</p>\n<p><a href=\"https://medium.com/@frewin.christopher/i-set-aside-1000-to-learn-options-trading-9a018f11f69e\">https://medium.com/@frewin.christopher/i-set-aside-1000-to-learn-options-trading-9a018f11f69e</a></p>\n<p>and the master post that I will link all further posts to (check out my catastrophic Facebook call failure):</p>\n<p><a href=\"https://medium.com/@frewin.christopher/i-set-aside-1000-to-learn-options-trading-53b934e55863\">https://medium.com/@frewin.christopher/i-set-aside-1000-to-learn-options-trading-53b934e55863</a></p>\n<p>you can follow my trades on twitter <a href=\"https://twitter.com/Galt_\">@Galt_</a>.</p>\n<p>I hope you enjoy watching me lose all my money! 😂</p>\n<p>Cheers! 🍺</p>\n<p>-Chris</p>","frontmatter":{"title":"I Set Aside $1000 to Learn Options Trading","date":"April 07, 2018","draft":false,"starID":14,"postType":"misc"}}},"pageContext":{"slug":"/i-set-aside-1000-to-learn-options-trading/","prev":{"fields":{"slug":"/interesting-monopoly-probabilities-to-defeat-your-relatives/"},"frontmatter":{"date":"29 December, 2018","title":"Interesting Monopoly Probabilities (To Defeat your Relatives For the Holidays!)","draft":false,"starID":103,"postType":"data","link":"https://chrisfrew.in/interesting-monopoly-probabilities-to-defeat-your-relatives/","relativeLink":"/interesting-monopoly-probabilities-to-defeat-your-relatives/"}},"next":{"fields":{"slug":"/its-my-blogs-birthday/"},"frontmatter":{"date":"12 December, 2018","title":"It's My Blog's Birthday!","draft":false,"starID":102,"postType":"blog","link":"https://chrisfrew.in/its-my-blogs-birthday/","relativeLink":"/its-my-blogs-birthday/"}}}}