{"data":{"site":{"siteMetadata":{"title":"Chris Frewin's Full Stack, Web Development, ABAP, SAPUI5, Blockchain, Machine Learning, & Natural Language Processing Blog.","author":"Chris Frewin"}},"markdownRemark":{"id":"a2e72fb1-43c3-5991-b679-07f27f5905dd","excerpt":"Thoughts of yet another full-time worker going full-time freelance / tinkerer / creative / nomad. * * * Note: this post is mirrored on my…","html":"<h2>Thoughts of yet another full-time worker going full-time freelance / tinkerer / creative / nomad.</h2>\n<p>***Note: this post is mirrored on my Medium: <a href=\"https://medium.com/@frewin.christopher/welp-i-did-it-24505dff1bd1\">https://medium.com/@frewin.christopher/welp-i-did-it-24505dff1bd1</a></p>\n<h2>Welp.</h2>\n<p>I quit my full-time job.</p>\n<p>Most of the time about major life decisions like this, all you here is the same old tune:</p>\n<blockquote>\n<p>Don’t do this don’t do this don’t do this. </p>\n</blockquote>\n<p>But jeez, people are so risk-averse sometime. Just thinking about my own situation, right now, I’m 100x better off than I was just 3 years ago, when I was 23, $27K in debt from my bachelor degree, and earning less than <em>half</em> of what I do now! How come nobody back then said:</p>\n<blockquote>\n<p>Don’t do this don’t do this don’t do this</p>\n</blockquote>\n<p>Because being a homely, unkempt, poor graduate student is <em>expected</em> by society, (although graduate school is even looked upon with reverence in some cases - “Wow, <em>Cornell</em>? Great school, great school.”). But what the hell are people thinking? In terms of net worth back then, I was totally screwed!</p>\n<p>If you are in your mid-20s reading this, you’re probably in the same situation of a strongly improved financial situation. So, why would I risk going total freelance when I have a house and kids, when <em>real</em> bills need to be paid? You’re right - I wouldn’t. </p>\n<p>The way I see it, now is not only the <em>only</em> time to try this, it’s the <em>perfect</em> time: experience and network connections from my first few years at a big industry job, with a bunch of savings as an all-else fails cushion in the bank.</p>\n<p>Even a lot of well-known ‘creatives’ these days also say not to do this until you have a self-sustaining (or better yet - profitable) side project, but I just couldn’t help but writing that notion off - most of them quit their jobs themselves when they were getting started! Yes - they talk about the strife and challenge it was from doing that, which is why they don’t recommend it to anyone else - but isn’t that exactly the ingredient required in the recipe of nearly all people who were once nobody and emerged with amazing projects and products? </p>\n<p>If you want to create truly nice projects of high quality, that aren’t just patched together, even if you are hacking away those 4-5 hours a night, <em>after</em> your full-time job, you just can’t. Well - at least I can’t. </p>\n<p>In my case, I need those multiple 12 hour, interrupted days, diving deep and building complex projects. This just isn’t sustainable with a full-time job - and indeed, perhaps this is exactly the ‘strife’ and ‘challenge’ that these creatives refer to in all of their ‘early days’. It’s true - while we all complain about our 9-5 jobs (in my case, 7-5), you can’t help but admitting there is a lot of comfortability and security in them - weekdays only, and (for most of us) 5PM is 5PM, when the clock hits 5, there’s no more work for the day. It will be interesting to see how that goes in my freelance life.</p>\n<p>But hey, it’s 2018, and “quitting your day job”, especially as a software engineer, doesn’t really mean you’re immediately ‘unemployed’ - right? There were a large number of supporting variables and events over the past few months that have led me to my decision:</p>\n<ul>\n<li>talking to <a href=\"torch.io\">torch.io</a> over a possible part time frontend consulting work</li>\n<li>being added to the <a href=\"moonlightwork.com\">Moonlight Community</a></li>\n<li>talking to a colleague about a fixed part-time position at his software company</li>\n<li>working with a friend to build a keyboard that charges as you type (I know it sounds like magic but the science and numbers show it can work) <a href=\"https://charge-keyboard.com\">charge-keyboard.com</a></li>\n<li>building out and advertising my startup Siren Apparel, and expanding to the EU <a href=\"https://sirenapparel.us\">https://sirenapparel.us</a>, <a href=\"https://sirenapparel.eu\">https://sirenapparel.eu</a></li>\n<li>(only knowing after I quit) consulting opportunities at my current company</li>\n</ul>\n<p>So yes, any one or a combination of these will pay the bills.</p>\n<p>I realize, <em>none</em> of these (or probably even a combination) will pay as high as my comfy logistic / warehousing full-time job. But I also realized over the past few months, <em>I don’t give a damn about money!</em> Sure, I could go the Mr. Money Mustache route and just keep truckin’ away at my current job with a high savings rate, and become financially independent in 7-8 years. But to me, that’s 7-8 years of sunk cost, working at albeit a decent, but ultimately where-I-don’t-want-to-be job. If I spent those 7-8 years building out projects that:</p>\n<ol>\n<li>Allow me enough income to survive</li>\n</ol>\n<p>and </p>\n<ol start=\"2\">\n<li>Are valuable projects that I value and believe make a difference in the world</li>\n</ol>\n<p>Then I have many many years after that to continue building, instead of after those 7-8 years, starting ‘fresh’ only with the single added confidence that I am financially independent. </p>\n<p>Worst case, I fail and a year from now I run back to the security of a full-time job. (Hopefully not the case!)</p>\n<p>It’s a similar story with options trading, <a href=\"https://medium.com/@frewin.christopher/i-set-aside-1000-to-learn-options-trading-b32bf47db656\">another toy project of mine</a>. A lot of people say you can learn a lot from paper trading, but people with real trading experience say you can never really learn unless real money is on the line. If I springboard into the abyss that is freelance / maker / creative / digital nomad, I’m <em>forced</em> to do my best work, and a lot of it, because it’s the only chance I have to pay my bills. Quotes that ring to this tune can be seen all over by (now) extremely successful people:</p>\n<blockquote>\n<p>I was in the zone, trying to make a living<br/>\nHeading to work in the morning<br/>\nNobody felt like I was mourning, as my dream was deceased<br/>\nUntil I quit my job, then my work ethic increased<br/>\nElevated to levels I ain’t ever seen</p>\n</blockquote>\n<p>-Logic</p>\n<blockquote>\n<p>Everything that you want is on the other side of fear</p>\n</blockquote>\n<p>-George Addair</p>\n<blockquote>\n<p>People will choose unhappiness over uncertainty</p>\n</blockquote>\n<p>-Tim Ferriss</p>\n<p>The bottom line is that in this information age, there are so many lines to connect, so many beautiful projects that can be made, so many companies and services that will flourish that we couldn’t even think of existing yet, even if we tried - but each of those requires time and hard critical thinking and problem solving. </p>\n<p>Have I accomplished something when a pallet comes out of the warehouse 5 seconds faster? In my book, not really. </p>\n<p>What if I build, with old friends from university, a revolutionary, first-of-its-kind, self-charging wireless keyboard that lasts a lifetime, and then some? I think yes. </p>\n<p>What about creating amazing designs for the 28 fire departments of each of the EU’s capital cities, monetizing it, and giving all the profits back to those departments? Yes.</p>\n<p>What about an art display: computer-assisted, colorized vector generated images of all 486 mountain lodges in the Austrian Alpine Club? Yep.</p>\n<p>And so I’m doing it - Its time for me to spread my wings and fly. I’ll check back in a year on this post - a post-mortem if you will. </p>\n<p>Hopefully it won’t be me that the post-mortem is written about.</p>\n<p>-Cheers! :beer:</p>\n<p>Chris</p>","frontmatter":{"title":"Welp, I Did It. I Quit.","date":"July 22, 2018","draft":false}}},"pageContext":{"slug":"/welp-i-did-it-i-quit/","prev":{"fields":{"slug":"/warn-sap-users-of-locked-objects-then-kill-their-session/"},"frontmatter":{"date":"09 May, 2018","title":"Warn SAP Users of Locked Objects Then Kill Their Session","draft":false,"link":"https://chrisfrew.in/warn-sap-users-of-locked-objects-then-kill-their-session/","relativeLink":"/warn-sap-users-of-locked-objects-then-kill-their-session/"}},"next":null}}