{"data":{"site":{"siteMetadata":{"title":"Chris Frewin's Full Stack Blog.","author":"Chris Frewin"}},"markdownRemark":{"id":"f9ee11a1-6ecd-5185-9e3c-549650e158cb","excerpt":"Every Dev’s Doing It! Blogging about their goals for 2019, of course!  I find that making  goals  works best for me, as they are more…","html":"<h2>Every Dev’s Doing It!</h2>\n<p>Blogging about their goals for 2019, of course! </p>\n<p>I find that making <em>goals</em> works best for me, as they are more concrete than resolutions, which our friends at <a href=\"https://www.google.com/search?q=resolution&#x26;oq=resolution\">google state, is ‘a firm decision to do or not to do something’</a>. Seems to me then, that new year’s ‘resolutions’ are something that can quickly be ‘broken’, and that’s at the moment you go against your original ‘decision’. Goals are bit bigger, and they are something to actively work <em>towards</em>, you can’t really ‘break’ your goal. I suppose you can just make no effort to work towards them, but they’ll make you guilt if you don’t work towards them 😄. So make goals for 2019! 😉</p>\n<p>Okay, enough with the New Year’s philosophy already… 🙄</p>\n<p>Anyway, this year should be exciting, as I’m not bound to a fixed location of work for 42.5 hours a week. With that said, I’ll still be using the traditional 40 hours a week to develop my skills and continue building projects.</p>\n<h2>Goals for 2019</h2>\n<p>I’ve divided my goals into directly career oriented goals and miscellaneous (mostly hobby and )</p>\n<h3>Software Engineering and Career Goals</h3>\n<ul>\n<li>Learn Typescript and incorporate it into personal stack (as a first challenge)</li>\n<li>Find a paying freelance employer or project (in addition to what looks like a 60-80% time fixed contract for 2019. I should have the time for this)</li>\n<li>Finally make a profitable side hustle! (I’m not sure if it will be software product or different products entirely, or another shot at an e-commerce store. I suppose since it’s a fresh start this year, I have to be honest with myself about <a href=\"https://sirenapparel.us\">Siren Apparel</a>. The bottom line is that nobody visits the site! I’m going to deactivate our Shopify subscription this month and leave up the website as a boutique made-to-order store.)</li>\n<li>Earn at least $1000 through my Skillshare course(s) (If it’s more obviously I will be very happy!)</li>\n</ul>\n<h3>Miscellaneous Goals</h3>\n<ul>\n<li>Read more (I even made a <a href=\"https://www.goodreads.com/challenges/8863-2019-reading-challenge\">‘read 30 books’ goal on goodreads.com</a> - I’ll aim for that first, but honestly it should be even more for all of 2019. I think this year I will start properly keeping track of my books on goodreads.com as well.)</li>\n<li>Paint more (I made a few number of acrylic and watercolor pieces back in 2017, but 2018 was a very slow year in terms of physical pieces art. I published <a href=\"https://instagram.com/chris_creates_art\">much more digital art in 2018</a>.)</li>\n<li>Record and publish at least 2 songs (Acquiring the bare minimum for a home studio was also new for me in 2018, at least in the last half of the year. I’m learning just how hard recording with a professional microphone is. It will take practice and some good song writing, but I am confident to release a few songs this year, more if there is time.)</li>\n<li>Run a marathon (fitness itself was not a problem for me in 2018, I did some massive hikes, as is a tradition in summer for me, but i just couldn’t find the time - or courage (?) - to go out and do one 😂)</li>\n</ul>","frontmatter":{"title":"Obligatory 'Goals for 2019' Post","date":"January 03, 2019","draft":false,"starID":105,"postType":"misc"}}},"pageContext":{"slug":"/obligatory-goals-for-2019-post/","prev":{"fields":{"slug":"/interesting-monopoly-probabilities-to-defeat-your-relatives/"},"frontmatter":{"date":"29 December, 2018","title":"Interesting Monopoly Probabilities (To Defeat your Relatives For the Holidays!)","draft":false,"starID":103,"postType":"data","link":"https://chrisfrew.in/interesting-monopoly-probabilities-to-defeat-your-relatives/","relativeLink":"/interesting-monopoly-probabilities-to-defeat-your-relatives/"}},"next":null}}