{"data":{"site":{"siteMetadata":{"title":"Chris Frewin's Full Stack Blog.","author":"Chris Frewin"}},"markdownRemark":{"id":"6a231307-a6d5-5b74-a322-cc9dce97b4c1","excerpt":"The motivation of this post popped into my head sometime over the last few weeks, as their has been another  wave of scary environmental…","html":"<p>The motivation of this post popped into my head sometime over the last few weeks, as their has been another <a href=\"https://www.theguardian.com/environment/2018/dec/03/david-attenborough-collapse-civilisation-on-horizon-un-climate-summit\">wave of scary environmental press from the UN</a>, and of course the <a href=\"https://unfccc.int/katowice\">next set of climate talks in Katowice, Poland that are currently taking place</a></p>\n<p>I often see that individuals have general feelings of despair and nihlism about climate change: that the problem is too big, that one person can’t make a difference, and so on. That is a problem in and of itself! If the default feeling is one of hopelessness, well guess what? The culture around environmental protection, climate change, and the like, will be one of hopelessness!</p>\n<p>But, I have a fix for that! </p>\n<p><img src=\"/thumbs-023fb0932bd433ca33ca0fe88a78d797.gif\" alt=\"A fix.\">\n<sub>Yes!</sub></p>\n<p>A simple list, of things I already to myself, that I feel are combats to </p>\n<p>I’ll admit, this is a bit of moral bragging on my part, but at the same time, these are things that, once you make the switch, you don’t really need to think about them anymore. It’s a one-time action, so get out there and make the switch! </p>\n<p>So, here’s my simple list. I invite you to ‘make the switch’ to all of them, and to think of any of your own!</p>\n<ul>\n<li>Paying 5-10% extra per month for renewable energy from the grid (I believe most energy providers have this option these days - and yes, we know the electrons in the grid come from a variety of sources, the majority of them, unfortunately, still from fossil fuels, but the electricity company uses the money that you pay extra to in turn pay those renewable energy providers, such as wind and solar, ultimately encouraging them to grow and creating a positive adoption feedback cycle)</li>\n<li>Eating meat once per week max (if you’re doing even less, great!)</li>\n<li>Not owning a car (feet, bikes, and buses rule! Additionally, I’ve been over skeptical of the public transportation system in the US, spoiled by the system here in Europe - but I’ve found between local bus routes, Greyhound, and Amtrak, our situation in the US is not so bad - it’s just that our country is so damn big :)</li>\n<li>Buying local vegetables and (this one is already well underway around the world and most of the time quite easy to follow, and I’m pleased to see it develop)</li>\n<li>(I almost forgot this one that its so easy to forget from my lifestyle) No air conditioning - suck it up, and yes it was the same in New York in 90 what do you think, well <em>all of humanity</em> did before <a href=\"https://www.google.com/search?q=what+year+was+air+condition+invented&#x26;oq=what+year+was+air+condition+invented&#x26;aqs=chrome..69i57j69i64.6281j0j7&#x26;sourceid=chrome&#x26;ie=UTF-8\">1902</a>?</li>\n</ul>\n<p>You’ll find interestingly, that these points, while providing environmental benefit, are the exact same points that early-retirement hero <a href=\"\">Mr. Money Moustache (MMM) also touts as excellent money savers</a>! (If you don’t know who MMM is, here’s a one sentence overview: MMM is a super thrifty individual who worked for 10 years, saving a huge majority of his income, and retired with his wife at age 30.)</p>\n<p>Actually, the benefits from these points would really be visible multi-fold, if everyone did them. Just as I write this post, I can immediately think of a few benefits that would emerge:</p>\n<ul>\n<li>cleaner air where population density is high (no personal cars)</li>\n<li>higher respect for meat as a luxury item, and thus higher respect and treatment of livestock (and likely higher quality!).</li>\n</ul>\n<p>And granted, I likely have, the biggest of which is not needing a car.</p>\n<p>The crucial point comes back to what I said at the beginning. If everyone is hopeless by default, they won’t even take these points to heart, thinking. These are things that <em>everyone</em> needs to do to be effective. But ‘everyone’ always starts with just one person.</p>\n<p>Cheers!</p>","frontmatter":{"title":"Simple Actions You Can Take Right Now to Help Environmental Efforts","date":"December 07, 2018","draft":false,"starID":100}}},"pageContext":{"slug":"/simple-things-you-can-do-right-now-to-help-environmental-efforts/","prev":{"fields":{"slug":"/the-dreaded-referenceerror-window-is-not-defined/"},"frontmatter":{"date":null,"title":"","draft":null,"starID":null,"link":"https://chrisfrew.in/the-dreaded-referenceerror-window-is-not-defined/","relativeLink":"/the-dreaded-referenceerror-window-is-not-defined/"}},"next":null}}