{"data":{"site":{"siteMetadata":{"title":"Chris Frewin's Full Stack Blog.","author":"Chris Frewin"}},"markdownRemark":{"id":"73844265-8049-52a7-aa2a-af12c8521af6","excerpt":"chrisfrew.in as a company! Hello there! In March of 2018 I streamlined my business process from my old doing business as (DBA) startup…","html":"<h1>chrisfrew.in as a company!</h1>\n<p>Hello there! In March of 2018 I streamlined my business process from my old doing business as (DBA) startup, Siren Apparel (it’s still alive!) <a href=\"https://sirenapparel.us\">https://sirenapparel.us</a> with the more general name of this site, chrisfrew.in (that also is creatively my name of course 😉). This DBA name will make more sense to spin off multiple websites, apps, and digital products all under the new DBA name, <em>chrisfrew.in</em>. Tasty.</p>\n<h1>For New York state, how can you change your DBA name?</h1>\n<p>To change your DBA name, it’s basically two steps, one at the federal level and one at the state level:</p>\n<ol>\n<li>A written letter to the Internal Revenue Service stating your intent to change the name. In the case of a sole proprietorship (like mine) there is no need to change you Employee Identification Number (EIN, also known as the Tax Identification Number or Tax ID). The IRS says that you have to write to the same IRS address that you sent your last tax address for the company for. Because I have a sole proprietorship, I can file for Siren Apparel (now chrisfrew.in) to this address:</li>\n</ol>\n<div class=\"gatsby-highlight\">\n      <pre class=\"language-text\"><code class=\"language-text\">Department of the Treasury\nInternal Revenue Service\nKansas City, MO  64999-0002</code></pre>\n      </div>\n<br/>\n<ol start=\"2\">\n<li>A DTF-65 form (for New York State since I live there) also indicating the name change (in the case of other states I assume this step would be similar, just a matter of finding the proper form for your state.)</li>\n</ol>\n<h1>TL;DR;</h1>\n<p>Fill out and send two forms; and you’re legally set!</p>\n<p><em>in other words,</em></p>\n<p>😎 Its time to make some more startups. 😎</p>","frontmatter":{"title":"Introducing my (new / same?!) company chrisfrew.in! (and how to change your DBA name)","date":"March 01, 2018","draft":false,"starID":13,"postType":"misc"}}},"pageContext":{"slug":"/introducing-chrisfrewin-productions/","prev":{"fields":{"slug":"/interesting-monopoly-probabilities-to-defeat-your-relatives/"},"frontmatter":{"date":"29 December, 2018","title":"Interesting Monopoly Probabilities (To Defeat your Relatives For the Holidays!)","draft":false,"starID":103,"postType":"data","link":"https://chrisfrew.in/interesting-monopoly-probabilities-to-defeat-your-relatives/","relativeLink":"/interesting-monopoly-probabilities-to-defeat-your-relatives/"}},"next":{"fields":{"slug":"/jump-from-SAPUI5-to-transactions-in-web-gui-with-batch-input/"},"frontmatter":{"date":"25 January, 2018","title":"Jump from SAPUI5 Apps to Transactions in Web GUI with Batch Input","draft":true,"starID":33,"postType":"dev"}}}}